export const ru = {
    search: {
        noQuery: "Пожалуйста, укажите запрос для поиска. Пример: /search название песни",
        error: "Произошла ошибка при поиске видео.",
    },
    download: {
        start: "Загрузка началась. Пожалуйста, подождите.",
        error: "Произошла ошибка при загрузке.",
        mp3Started: "Начинается загрузка MP3...",
        mp3Uploading: "Загружаем ваш MP3...",
        mp3Error: "Ошибка при загрузке MP3",
        videoNotFound: "Ссылка на видео не найдена.",
    },
    buttons: {
        downloadMP3: "Скачать MP3🎵",
        downloadMP4: "Скачать MP4🎥",
    },
    video: {
        info: "Видео: ${title}\nКанал: ${channel}"
    },
    settings: {
        title: "⚙️ Настройки",
        downloadType: "📥 Тип загрузки:",
        language: "🌐 Язык интерфейса:",
        updated: "Настройки успешно обновлены",
        currentLanguage: "Текущий язык: Русский",
        languageChanged: "✅ Язык успешно изменен на Русский",
        downloadTypeChanged: "✅ Тип загрузки по умолчанию изменен на ${type}",
        currentSettings: "⚙️ Настройки\n\n🌐 Язык: ${language}\n📥 Тип загрузки: ${downloadType}"
    }
};
